Rhino.Inside.Revit API
RenderMaterialConverter Class
 Represents a converter for converting Rhino.Render.RenderMaterial values back and forth Revit and Rhino.
Inheritance Hierarchy
System.Object
 RhinoInside.Revit.Convert.Render.RenderMaterialConverter
 Namespace: RhinoInside.Revit.Convert.Render
 Assembly: RhinoInside.Revit (in RhinoInside.Revit.dll) Version: 1.7.8130
Syntax
public static class RenderMaterialConverter
class RenderMaterialConverter
The RenderMaterialConverter type exposes the following members.
Methods
Name | Description
ToRenderMaterial
 Converts the specified Autodesk.Revit.DB.Material to an equivalent Rhino.Render.RenderMaterial in given Rhino.RhinoDoc.
Top
See Also
Reference
RhinoInside.Revit.Convert.Render Namespace